# YOLOv5 �� by Ultralytics, GPL-3.0 license
# Custom Config: YOLOv5s + P2 Head (4 Heads) + Slim-Neck (GSConv)

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]        # P2/4 (Tiny Objects)
  - [16, 21, 18, 24, 21, 21]  # P3/8
  - [22, 26, 24, 31, 26, 22]  # P4/16
  - [30, 28, 36, 33, 40, 43]  # P5/32

# Backbone (保持标准 CSPDarknet 以保证特征提取能力)
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],            # 2 (P2 feature)
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C3, [256]],            # 4 (P3 feature)
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 9, C3, [512]],            # 6 (P4 feature)
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32
   [-1, 3, C3, [1024]],           # 8 (P5 feature)
   [-1, 1, SPPF, [1024, 5]],      # 9
  ]

# Head (Slim-Neck Design: GSConv + VoVGSCSP)
head:
  # --- Top-Down Pathway (FPN) ---
  [[-1, 1, GSConv, [512, 1, 1]],                  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 11
   [[-1, 6], 1, Concat, [1]],                     # 12 cat backbone P4
   [-1, 3, VoVGSCSP, [512, False]],               # 13

   [-1, 1, GSConv, [256, 1, 1]],                  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 15
   [[-1, 4], 1, Concat, [1]],                     # 16 cat backbone P3
   [-1, 3, VoVGSCSP, [256, False]],               # 17 (P3/8-small)

   # --- P2 Pathway (Extended for Tiny Objects) ---
   [-1, 1, GSConv, [128, 1, 1]],                  # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 19
   [[-1, 2], 1, Concat, [1]],                     # 20 cat backbone P2
   [-1, 3, VoVGSCSP, [128, False]],               # 21 (P2/4-tiny) -> Head 1

   # --- Bottom-Up Pathway (PANet with GSConv) ---
   [-1, 1, GSConv, [128, 3, 2]],                  # 22 (Downsample P2->P3)
   [[-1, 18], 1, Concat, [1]],                    # 23 cat head P3 (Layer 18 output)
   [-1, 3, VoVGSCSP, [256, False]],               # 24 (P3/8-small) -> Head 2

   [-1, 1, GSConv, [256, 3, 2]],                  # 25 (Downsample P3->P4)
   [[-1, 14], 1, Concat, [1]],                    # 26 cat head P4 (Layer 14 output)
   [-1, 3, VoVGSCSP, [512, False]],               # 27 (P4/16-medium) -> Head 3

   [-1, 1, GSConv, [512, 3, 2]],                  # 28 (Downsample P4->P5)
   [[-1, 10], 1, Concat, [1]],                    # 29 cat head P5 (Layer 10 output)
   [-1, 3, VoVGSCSP, [1024, False]],              # 30 (P5/32-large) -> Head 4

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]