# YOLOv5 + LSNet-V2 (Transformer Hybrid)
# Parameters
nc: 80 # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

#anchors:
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

anchors:
  - [ 16, 21, 18, 24, 21, 21 ]
  - [ 22, 26, 24, 31, 26, 22 ]
  - [ 30, 28, 36, 33, 40, 43 ]

# LSNet-V2 backbone
backbone:
  # [from, number, module, args]
  # -------------------------------------------------------------------------
  # 重点修改在这里：
  # args 传入 ['t'], ['s'] 或 ['b']。
  # 't' (Tiny) 通道为 [64, 128, 256]，与之前的 LSNet-Pro 一致，推荐首选。
  # -------------------------------------------------------------------------
  [[-1, 1, LSNetBackbone, ['t']],

   # 1-3. 拆分 LSNet 输出的列表 (保持不变)
   [-1, 1, IndexSelect, [0]],  # Index 0 -> P3 (Stride 8)
   [-2, 1, IndexSelect, [1]],  # Index 1 -> P4 (Stride 16)
   [-3, 1, IndexSelect, [2]],  # Index 2 -> P5 (Stride 32)
  ]

# YOLOv5 Head (保持不变)
# 注意：如果你把 backbone 改成了 ['s'] 或 ['b']，这里的通道数可能需要调整，
# 但 YOLOv5 通常会自动计算宽度，所以大概率也能直接跑。
head:
  [[-1, 1, Conv, [256, 1, 1]], # 对接上一层(也就是IndexSelect[2], P5)
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat P4 (Layer 2)
   [-1, 3, C3, [256, False]],  # 7

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],  # cat P3 (Layer 1)
   [-1, 3, C3, [128, False]],  # 11 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 14 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512, False]],  # 17 (P5/32-large)

   [[11, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]