# YOLOv5 �� by Ultralytics, GPL-3.0 license
# Config: P2 Head + GSConv Slim-Neck + LSKNet Attention

# Parameters
nc: 80
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [5,6, 8,14, 15,11]       # P2
  - [16, 21, 18, 24, 21, 21] # P3
  - [22, 26, 24, 31, 26, 22] # P4
  - [30, 28, 36, 33, 40, 43] # P5

# Backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0
   [-1, 1, Conv, [128, 3, 2]],    # 1
   [-1, 3, C3, [128]],            # 2
   [-1, 1, Conv, [256, 3, 2]],    # 3
   [-1, 6, C3, [256]],            # 4
   [-1, 1, Conv, [512, 3, 2]],    # 5
   [-1, 9, C3, [512]],            # 6
   [-1, 1, Conv, [1024, 3, 2]],   # 7
   [-1, 3, C3, [1024]],           # 8
   [-1, 1, LSKBlock, [1024]],     # <--- 9. SPPF前加入LSK，增强高层语义的感受野
   [-1, 1, SPPF, [1024, 5]],      # 10
  ]

# Head (GSConv + LSK Fusion)
head:
  [[-1, 1, GSConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, VoVGSCSP, [512, False]],  # 14

   [-1, 1, GSConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, VoVGSCSP, [256, False]],  # 18

   # P2 Branch
   [-1, 1, GSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 1, LSKBlock, [256]],         # <--- 22. 在最小目标的P2层加入LSK (关键！)
   [-1, 3, VoVGSCSP, [128, False]],  # 23 (P2 Head feature)

   # Bottom-up
   [-1, 1, GSConv, [128, 3, 2]],
   [[-1, 19], 1, Concat, [1]],       # 注意索引对齐
   [-1, 3, VoVGSCSP, [256, False]],  # 26 (P3 Head)

   [-1, 1, GSConv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],
   [-1, 3, VoVGSCSP, [512, False]],  # 29 (P4 Head)

   [-1, 1, GSConv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],
   [-1, 3, VoVGSCSP, [1024, False]], # 32 (P5 Head)

   [[23, 26, 29, 32], 1, Detect, [nc, anchors]],
  ]